60000 train samples
10000 test samples
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_1 (InputLayer)             (None, 784)           0                                            
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 64)            50240       input_1[0][0]                    
____________________________________________________________________________________________________
prelu_1 (PReLU)                  (None, 64)            64          dense_1[0][0]                    
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 10)            650         prelu_1[0][0]                    
====================================================================================================
Total params: 50,954
Trainable params: 50,954
Non-trainable params: 0
____________________________________________________________________________________________________
Train on 60000 samples, validate on 10000 samples
Epoch 1/20
Test score: 0.0972079161135
Test accuracy: 0.9739
